# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

## Objectives

You will be able to:
- Query data using one-to-many and many-to-many joins
- Predict the resulting size of one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [8]:
query = 'select firstName,lastName, city, state from employees join offices using (officeCode) group by firstName  '
pd.read_sql(query,conn)

   firstName   lastName           city       state
0       Andy     Fixter         Sydney
1    Anthony        Bow  San Francisco          CA
2      Barry      Jones         London
3      Diane     Murphy  San Francisco          CA
4   Foon Yue      Tseng            NYC          NY
5     George     Vanauf            NYC          NY
6     Gerard  Hernandez          Paris
7       Jeff   Firrelli  San Francisco          CA
8      Julie   Firrelli         Boston          MA
9      Larry       Bott         London
10    Leslie   Thompson  San Francisco          CA
11      Loui     Bondur          Paris
12      Mami      Nishi          Tokyo  Chiyoda-Ku
13    Martin     Gerard          Paris
14      Mary  Patterson  San Francisco          CA
15    Pamela   Castillo          Paris
16     Peter      Marsh         Sydney
17     Steve  Patterson         Boston          MA
18       Tom       King         Sydney
19   William  Patterson         Sydney
20   Yoshimi       Kato          Tokyo  Chiyoda-Ku

## Customers and their Orders (a One-to-Many join)

Return a list of all the customers first and last names along with a record for each of their order numbers, order dates and statuses.

In [10]:
query = 'select ContactfirstName,ContactlastName, ordernumber, orderdate, status from customers join orders using (Ordernumber) group by contactfirstName  '
pd.read_sql(query,conn)

DatabaseError: Execution failed on sql 'select ContactfirstName,ContactlastName, ordernumber, orderdate, status from customers join orders using (Ordernumber) group by contactfirstName  ': cannot join using column Ordernumber - column not present in both tables

## Customers and their Payments (another One-to-Many join)

Return a list of customers first and last names along with details about their payments including the amount and date of payments. Sort these results in descending order by the payment amount.

In [3]:
# Your code here

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of customer first and last names, product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [4]:
# Your code here

## Summary

In this lab, you practiced your knowledge on one-to-many and many-to-many relationships!